let sentences = [
  "التاريخ هو تحليل وفهم للأحداث والتطورات الاجتماعية والحضارية التي تحدث في بقعة جغرافية معينة أو في قوم أو شعب معين في محاولة لاستذكار الماضي واستخراج العبر منه. تختلف معتقدات المؤرخين فينتج عنه اختلاف رؤيتهم للتاريخ وعدم الحيادية في أحوال أخرى كما قد لا يتوافر لدى بعضهم الرؤية الشاملة للأحداث وما وراء الأحداث في ذلك الوقت، تختلف نظرة المؤرخين وعلماء التاريخ نحو التاريخ وتفسيراته مما ينتج ما يمكن تسميته نظريات التاريخ.يعمل التاريخ على دراسة تعتمد على حقائق الماضي وتتبع سوابق الأحداث في الماضي والحاضر، ودراسة ظروف السياقات التاريخية وتفسيرها في الماضي والحاضر والمستقبل فمنهج البحث التاريخي هو مجموعة الطرق والتقنيات التي يتبعها الباحث والمؤرخ للوصول إلى الحقيقة التاريخية، وإعادة بناء الماضي بكل وقائعه وزواياه، كما كان عليه زمانه ومكانه تبعاً لذلك فالمنهج التاريخي يحتاج إلى ثقافة واعية وتتبع دقيق بحركة الزمن التي تؤثر بصورة مباشرة أو غير مباشرة على النص التاريخي، لهذا من الواجب ارتباط المنهج بمستويات النقد في كل مراحله الممثلة في التفسير والتأويل والتنقيح والحكم نظرا لعنايته الجادة بالنص كرؤية واقعية ترتبط بالزمن والعصر.",
  "اﻹعلام هو مصطلح يطلق على أي وسيلة أو تقنية أو منظمة أو مؤسسة تجارية أو أخرى غير ربحية، عامة أو خاصة، رسمية أو غير رسمية، مهمتها نشر الأخبار ونقل المعلومات، إلا أن اﻹعلام يتناول مهاما متنوعة أخرى، تعدت موضوع نشر الأخبار إلى موضوع الترفيه والتسلية خصوصا بعد الثورة التلفزيونية وانتشارها الواسع. تطلق على التكنولوجيا التي تقوم بمهمة اﻹعلام والمؤسسات التي تديرها اسم وسائل اﻹعلام، كما يُطلق على الأخيرة تعبير السلطة الرابعة للإشارة إلى تأثيرها العميق والواسع.",
  "يشير مفهوم وسائل اﻹعلام المستقلة إلى أي شكل من أشكال الوسائط، مثل المذياع أو التلفاز أو الصحف أو اﻹنترنت، البعيدة عن النفوذ الذي قد تفرضه مصالح الحكومة أو الشركات. ويشتمل هذا المصطلح على تطبيقات متنوعة. وغالبًا ما يستخدم هذا المصطلح كمرادف لمصطلح اﻹعلام البديل داخل الولايات المتحدة وغيرها من الدول المتقدمة، وذلك للإشارة إلى الوسائط التي تختلف على وجه التحديد عن وسائل اﻹعلام السائدة. وفيما يتعلق بالتنمية الدولية، يستخدم مصطلح اﻹعلام المستقل في مجال تنمية وسائل اﻹعلام الجديدة، وخاصة في الأماكن التي تشهد القليل من التواجد اﻹعلامي القائم.",
  "علم الاجتماع علم يعنى بدراسة خصائص الجماعات البشرية والتفاعلات المختلفة والعلاقات بين أفراد هذه الجماعات. يعتبر أوغست كونت من أهم الباحثين في علم الاجتماع ويعتبر المؤسس الغربي له إلا أن الكثير من العرب يعتبرون عبد الرحمن بن خلدون بملاحظاته الذكية في طبائع العمران البشري التي دونها في مقدمته الشهيرة المؤسس الفعلي لعلم الاجتماع. علم الاجتماع هو دراسة الحياة الاجتماعية للبشرِ، سواء بشكل مجموعات، أو مجتمعات، وقد عرّفَ أحياناً كدراسة التفاعلات الاجتماعية. وهو توجه أكاديمي جديد نسبياً تطور في أوائل القرن التاسع عشرِ ويهتم بالقواعد والعمليات الاجتماعية التي تربط وتفصل الناس ليسوا فقط كأفراد، لكن كأعضاء جمعيات ومجموعات ومؤسسات.",
  "الثقافة هي سلوك اجتماعي ومعيار موجود في المجتمعات البشرية. تعتبر الثقافة مفهومًا مركزيًا في الأنثروبولوجيا، يشمل نطاق الظواهر التي تنتقل من خلال التعلم الاجتماعي في المجتمعات البشرية. بعض جوانب السلوك الإنساني، والممارسات الاجتماعية مثل الثقافة، والأشكال التعبيرية مثل الفن، الموسيقى، الرقص، الطقوس، والتقنيات مثل استخدام الأدوات، الطبخ، المأوى، والملابس هي بمثابة كليات ثقافية، توجد في جميع المجتمعات البشرية. مفهوم الثقافة المادية يغطي التعبيرات المادية للثقافة، مثل التكنولوجيا، والهندسة المعمارية والفن، في حين أن الجوانب غير المادية للثقافة مثل مبادئ التنظيم الاجتماعي، الأساطير، الفلسفة، الأدب، والعلم يتكون من التراث الثقافي غير المادي للمجتمع.",
  "كلمة الجغرافيا في اللغة العربية تعتبر حديثة بعض الشيء، حيث كان العرب والمسلمون يستعملون مصطلحات كصورة الأرض أو قطع الأرض أو خريطة العالم والأقاليم أو المسالك والممالك أو تقويم البلدان أو علم الطرق. فقد كان الرحالة يصفون ويسجلون مشاهداتهم عن البلاد والأقاليم التي يزورونها. وتنقسم الجغرافيا إلى قسمين رئيسيين وهما الجغرافيا الطبيعية والجغرافيا البشرية.",
];
// html elements
let wordsCount = document.querySelector(".wordsCount span");
let seconds = document.querySelector(".time span");
let wordShow = document.querySelector(".word");
let input = document.querySelector("#input");

window.onload = function () {
  input.focus();
  input.value = "";
};
input.onpaste = function () {
  return false;
};

let lastScore = document.querySelector("main .score");
let lastScoreSpan = document.querySelector("main .score h3 span");
let playAgainBtn = document.querySelector("main .score .click");

mainFunction();

playAgainBtn.onclick = () => {
  playAgain();
};

function mainFunction() {
  let sentence = sentences[Math.floor(Math.random() * sentences.length)];
  let words = sentence.split(" ");
  let wordsLength = words.length;
  let currentWordLength;
  let clicked = false;
  let timer;
  words.forEach((word) => {
    wordShow.innerHTML += `<span>${word} </span>`;
    currentWordLength = word.length;
  });
  input.onkeyup = () => {
    if (clicked === false) {
      timer = setInterval(() => {
        seconds.innerHTML--;
      }, 1000);
      clicked = true;
    } else {
      clicked = true;
    }
    let firstSpan = document.querySelector(".word span:first-child");
    if (input.value === firstSpan.textContent) {
      wordsCount.innerHTML++;
      input.value = "";
      words = words.slice(1);
      wordShow.innerHTML = "";
      words.forEach((word) => {
        if (words.length == 1) {
          wordShow.innerHTML += `<span>${word}</span>`;
        } else {
          wordShow.innerHTML += `<span>${word} </span>`;
        }
        currentWordLength = word.length;
      });
    }

    if (wordShow.childElementCount == 0 || seconds.innerHTML == 0) {
      wordShow.innerHTML = `<h3>انتهى</h3>`;
      input.setAttribute("disabled", "true");
      input.setAttribute("placeholder", "انتهى");
      clearInterval(timer);
      lastScoreSpan.innerHTML = `${wordsCount.innerHTML} كلمة في الدقيقة`;
      lastScore.classList.remove("none");
    }
  };
}

function playAgain() {
  seconds.innerHTML = "60";
  wordsCount.innerHTML = "0";
  lastScore.classList.add("none");
  wordShow.innerHTML = ``;
  input.removeAttribute("disabled");
  input.setAttribute("placeholder", "اكتب هنا");
  input.focus();
  mainFunction();
}
